/**
 $ npx ts-node ./run/dragon-pendant.ts
------------------ Подвеска Дракона Ур.1 -------------------
Подвеска Дракона Ур.1 => Подвеска Дракона Ур.1 +1 Map { 'Подвеска Дракона Ур.1' => 1, 'Лак Дракона' => 1 }
Подвеска Дракона Ур.1 => Подвеска Дракона Ур.1 +2 Map { 'Подвеска Дракона Ур.1' => 1, 'Лак Дракона' => 2 }
Подвеска Дракона Ур.1 => Подвеска Дракона Ур.1 +3 Map { 'Подвеска Дракона Ур.1' => 1, 'Лак Дракона' => 4 }
Подвеска Дракона Ур.1 => Подвеска Дракона Ур.1 +4 Map { 'Подвеска Дракона Ур.1' => 1, 'Лак Дракона' => 7 }
Подвеска Дракона Ур.1 => Подвеска Дракона Ур.1 +5 Map { 'Подвеска Дракона Ур.1' => 1, 'Лак Дракона' => 12 }
Подвеска Дракона Ур.1 => Подвеска Дракона Ур.2 Map {
  'Подвеска Дракона Ур.1' => 1,
  'Лак Дракона' => 12,
  'Адена' => 12000000 }

------------------ Подвеска Дракона Ур.2 -------------------
Подвеска Дракона Ур.2 => Подвеска Дракона Ур.2 +1 Map { 'Подвеска Дракона Ур.2' => 1, 'Лак Дракона' => 1 }
Подвеска Дракона Ур.2 => Подвеска Дракона Ур.2 +2 Map { 'Подвеска Дракона Ур.2' => 1, 'Лак Дракона' => 3 }
Подвеска Дракона Ур.2 => Подвеска Дракона Ур.2 +3 Map { 'Подвеска Дракона Ур.2' => 1, 'Лак Дракона' => 5 }
Подвеска Дракона Ур.2 => Подвеска Дракона Ур.2 +4 Map { 'Подвеска Дракона Ур.2' => 1, 'Лак Дракона' => 10 }
Подвеска Дракона Ур.2 => Подвеска Дракона Ур.2 +5 Map { 'Подвеска Дракона Ур.2' => 1, 'Лак Дракона' => 37 }
Подвеска Дракона Ур.2 => Подвеска Дракона Ур.3 Map {
  'Подвеска Дракона Ур.2' => 1,
  'Лак Дракона' => 40,
  'Адена' => 16000000 }

------------------ Подвеска Дракона Ур.3 -------------------
Подвеска Дракона Ур.3 => Подвеска Дракона Ур.3 +1 Map { 'Подвеска Дракона Ур.3' => 1, 'Лак Дракона' => 1 }
Подвеска Дракона Ур.3 => Подвеска Дракона Ур.3 +2 Map { 'Подвеска Дракона Ур.3' => 1, 'Лак Дракона' => 5 }
Подвеска Дракона Ур.3 => Подвеска Дракона Ур.3 +3 Map { 'Подвеска Дракона Ур.3' => 1, 'Лак Дракона' => 20 }
Подвеска Дракона Ур.3 => Подвеска Дракона Ур.3 +4 Map { 'Подвеска Дракона Ур.3' => 1, 'Лак Дракона' => 171 }
Подвеска Дракона Ур.3 => Подвеска Дракона Ур.3 +5 Map { 'Подвеска Дракона Ур.3' => 1, 'Лак Дракона' => 3423 }
 */

import { dragonPendantEnchantMap } from '../enchant/dragon-pendant';
import { header } from '../helpers/header';
import { itemsRange } from '../helpers/items-range';
import { run } from '../helpers/run';
import { Item } from '../items';

const times = 100_000;

console.log(header('Подвеска Дракона Ур.1'));
run(Item.DragonPendantOne, itemsRange(Item.DragonPendantOne_1, Item.DragonPendantTwo), times, dragonPendantEnchantMap);

console.log();
console.log(header('Подвеска Дракона Ур.2'));
run(
  Item.DragonPendantTwo,
  itemsRange(Item.DragonPendantTwo_1, Item.DragonPendantThree),
  times,
  dragonPendantEnchantMap,
);

console.log();
console.log(header('Подвеска Дракона Ур.3'));
run(
  Item.DragonPendantThree,
  itemsRange(Item.DragonPendantThree_1, Item.DragonPendantThree_5),
  times,
  dragonPendantEnchantMap,
);
